# DSCI 133: Introduction to Data Science and Engineering
## Spring 2020
## Homework - 2
## Due: 11.59.59pm Friday February 7, 2020

#### There are totally 20 questions that are followed by a blank cell. Please fill in the code in the blank cell, and remember to display the result. You are allowed to use class notebooks. Submit your notebook.

Because Jupyter Notebook will save the result of all codes that were executed before, if you are not sure whether your code is right and it may jeopardize the dataset ( for example: deleting some records), there are several ways to reset your data: 
* Rerun the cell that creates the data
* Delete your current cell or comment it, and  select "restart & run all" in the Kernel menu.
* Create a temporary variable that exactly copies the original dataframe, and test your codes on the temporary dataframe first.

#### 1.Import pandas under the name `pd` and numpy as `np`.

In [1]:
import numpy as np
import pandas as pd

Consider the following Python dictionary `data` and Python list `labels`:

#### 2. Create a DataFrame `df` from the dictionary below as `data` which has the index `labels`.
'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog']  
  'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3]  
'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1]  
'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']  

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [24]:

animalDictionary = {'a': 'cat', 'b':'cat', 'c' : 'snake', 'd':'dog','e':'dog','f':'cat','g':'snake','h':'cat','i':'dog','j':'dog' }
ageDictionary = {'a': 2.5, 'b': 3, 'c' : 0.5, 'd': np.nan,'e':5,'f':2,'g':4.5,'h':np.nan,'i':7,'j':3}
visitsDictionary = {'a': 1, 'b': 3, 'c' : 2, 'd': 3,'e': 2,'f': 3,'g': 1,'h': 1,'i': 2,'j': 1}
prioDictionary = {'a': 'yes', 'b': 'yes', 'c' : 'no', 'd': 'yes','e': 'no','f': 'no','g': 'no','h': 'yes','i': 'no','j': 'no'}


df = pd.DataFrame({'animal' : animalDictionary, 'age':ageDictionary, 'visits':visitsDictionary, 'priority':prioDictionary})

df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

#### 3. Print a summary of the basic information of the dataframe

In [3]:
print(df.describe())

            age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

#### 4. Print the first 3 rows of the DataFrame df. Also print the last 4 rows of the DataFrame.

In [4]:
print (df.head(3))
print (df.tail(4))

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
  animal  age  visits priority
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

#### 5. Select the data in rows `[3, 4, 8]` *and* in columns `['animal', 'age']`.

In [23]:
df.loc[['d','e','i'],'animal':'age']

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

#### 6. Select only the rows where the number of visits is greater than 3.

In [26]:
df.loc[df.visits>3,:]
#there are no rows with more than 3 visits. . .

Empty DataFrame
Columns: [animal, age, visits, priority]
Index: []

#### 7. Select the rows where the age is missing, i.e. is `NaN`.

In [7]:
print(df.loc[df.age.isnull(), :])

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

#### 8. Select the rows where the animal is a cat *and* the age is less than 3.

In [8]:
print(df.loc[(df.animal == 'cat')&(df.age <3),:])

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

#### 9. Change the age in row 'f' to 1.5.

In [9]:
print(df)
print("--------------------")
df.loc['f','age'] = 1.5
print(df)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no
--------------------
  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

#### 10. Calculate the sum of all visits (the total number of visits).

In [27]:
df.loc[:,'visits'].sum()

19

#### 11. Calculate the mean age for each different animal in `df`.

In [11]:
def meanAge(animal): #this function gets the data from the data frame, then turns it into an array, then traverses through it collecting the sum and # of items in the array to calculate mean
    animalAges = df.loc[df.animal == animal, "age"].values
    sum = 0
    count = 0
    for age in animalAges:
        if(age>0): #this line is to prevent issues with nan or other places where data isnt there
            sum += age
            count = count+1

    print("the average age of "+animal+"s in df are "+ str(sum/count))
meanAge('cat')
meanAge('dog')
meanAge('snake')

the average age of cats in df are 2.3333333333333335
the average age of dogs in df are 5.0
the average age of snakes in df are 2.5

#### 12. Append a new row 'k' to `df` with your choice of values for each column. Then delete row to return the original DataFrame.

In [12]:
dfK = pd.DataFrame([['dog', 0.7, 3, 'yes']], columns =['animal', 'age', 'visits', 'priority'], index = ['k'])
df = df.append(dfK)
print(df)
print("-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-")
df = df.drop('k')
print(df)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no
k    dog  0.7       3      yes
-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

#### 13. Count the number of each type of animal in `df`.

In [13]:
animals = df.loc[:,'animal']
animalList = [] #was going to use a dictionary but didnt know how to append the value on the fly so I used two arrays
animalCount = []
for animal in animals:
    if not animal in animalList:
        animalList.append(animal)
        animalCount.append(0)
    animalCount[animalList.index(animal)] += 1;
#this loop above goes through every animal from df and if its not in animal list addes it and creates a new animal count. . . it also updates the count so we can track # of each animal
    
for animal in animalList:
    print("there are "+str(animalCount[animalList.index(animal)])+ " "+animal+"s in df")

there are 4 cats in df
there are 2 snakes in df
there are 4 dogs in df

#### 14. Sort `df` first by the values in the 'age' in *decending* order (print your data frame), then by the value in the 'visit' column in *ascending* order (print your data frame).

In [14]:
print(df.sort_values(by=['age'], kind = 'mergesort', ascending = False)) #added kind mergesort just to see if I understood documentation and since I think merge sort is faster n^2>nlog(n) (though I think that only applies when the datasets are big)
print("*^*^*^*^*^*^*^*^*^*^*^*^*^*^*^*^*^*^*^*^*^*^*^^*^*^*^*^*^*^*^*")
print(df.sort_values(by=['visits'], kind = 'mergesort'))

  animal  age  visits priority
i    dog  7.0       2       no
e    dog  5.0       2       no
g  snake  4.5       1       no
b    cat  3.0       3      yes
j    dog  3.0       1       no
a    cat  2.5       1      yes
f    cat  1.5       3       no
c  snake  0.5       2       no
d    dog  NaN       3      yes
h    cat  NaN       1      yes
*^*^*^*^*^*^*^*^*^*^*^*^*^*^*^*^*^*^*^*^*^*^*^^*^*^*^*^*^*^*^*
  animal  age  visits priority
a    cat  2.5       1      yes
g  snake  4.5       1       no
h    cat  NaN       1      yes
j    dog  3.0       1       no
c  snake  0.5       2       no
e    dog  5.0       2       no
i    dog  7.0       2       no
b    cat  3.0       3      yes
d    dog  NaN       3      yes
f    cat  1.5       3       no

#### 15. The 'priority' column contains the values 'yes' and 'no'. Replace this column with a column of boolean values: 'yes' should be `True` and 'no' should be `False`. And print the new dataframe.

In [15]:
df =  df.replace({'priority':{'yes': True, 'no': False}})
df

  animal  age  visits  priority
a    cat  2.5       1      True
b    cat  3.0       3      True
c  snake  0.5       2     False
d    dog  NaN       3      True
e    dog  5.0       2     False
f    cat  1.5       3     False
g  snake  4.5       1     False
h    cat  NaN       1      True
i    dog  7.0       2     False
j    dog  3.0       1     False

#### 16. In the 'animal' column, change the 'snake' entries to 'python'.

In [28]:
df = df.replace({'animal':{'snake': 'python'}})
df

   animal  age  visits priority
a     cat  2.5       1      yes
b     cat  3.0       3      yes
c  python  0.5       2       no
d     dog  NaN       3      yes
e     dog  5.0       2       no
f     cat  2.0       3       no
g  python  4.5       1       no
h     cat  NaN       1      yes
i     dog  7.0       2       no
j     dog  3.0       1       no

#### 17. For each animal type and each number of visits, find the mean age. In other words, each row is an animal, each column is a number of visits and the values are the mean ages (hint: use a ``pd.pivot_table``).

In [29]:
pd.pivot_table(data = df, index = 'animal', values = "visits", aggfunc = 'mean') #added all the data = and index = so I can better see what is what allowing me to udnerstand how pivot table works better

        visits
animal
cat        2.0
dog        2.0
python     1.5

#### 18. Create a Data Frame with the following data:

From_To: ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn']  
FlightNumber: [10045, np.nan, 10065, np.nan, 10085]  
RecentDelays: [[23, 47], [], [24, 43, 87], [13], [67, 32]]  
Airline: ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']

In [18]:
df2 = pd.DataFrame({
    'From_To':['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
    'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
    'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
    'Airline': ['KLM(!)', ' (12)', '(British Airways. )','12. Air France', '"Swiss Air"']
})
df2

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []                 (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

#### 19. Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column), print the dataframe. Hint:(http://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.interpolate.html)

In [19]:
df2 = df2.interpolate()
df2

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []                 (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

#### 20. Read the data (provided: user_data) into a Data Frame and find the mean age per occupation. (Hint: data provided is a table, when you open the data table in notepad, you will see that data is seperated with a special symbol. Pandas has a function that can take seperation symbol)

In [20]:
df2 = pd.read_csv("user_data", sep = '|')


pd.pivot_table(df2, index = 'occupation', values = 'age') #creates pivot table like in q17 that goes by occupation and has the mean age form that occupation

                     age
occupation
administrator  38.746835
artist         31.392857
doctor         43.571429
educator       42.010526
engineer       36.388060
entertainment  29.222222
executive      38.718750
healthcare     41.562500
homemaker      32.571429
lawyer         36.750000
librarian      40.000000
marketing      37.615385
none           26.555556
other          34.523810
programmer     33.121212
retired        63.071429
salesman       35.666667
scientist      35.548387
student        22.081633
technician     33.148148
writer         36.311111